<h2>Pandas</h2>

In [1]:
import pandas as pd

<h3>series</h3>

* single diamentional dataset is called series

In [7]:
# panda series it is a column representation of 1-D array or list

a = [10, 12, 13, 11, 14, 15]

sr = pd.Series(a)

In [8]:
sr

0    10
1    12
2    13
3    11
4    14
5    15
dtype: int64

In [10]:
sr[1] # the label acts as the position of the value in the series and can be used to access it

12

In [12]:
# with index argument in the function we can add custom labels

sr_1 = pd.Series(a, index=[1, 2, 3, 4, 5, 6])

In [13]:
sr_1

1    10
2    12
3    13
4    11
5    14
6    15
dtype: int64

In [14]:
sr_1[1]

10

In [18]:
#dictionary can be used to create a series

d = {"company":"Rolls Royce", "model":"Phantom", "price":"60000000"}

sr_2 = pd.Series(d)

In [19]:
sr_2

company    Rolls Royce
model          Phantom
price         60000000
dtype: object

In [23]:
sr_2.company

'Rolls Royce'

In [26]:
# speciding index in this case only the value present in the index will be added to the series
sr_3 = pd.Series(d, index=["company", "model"])

In [29]:
sr_3 # only company and model were added not the price

company    Rolls Royce
model          Phantom
dtype: object

<h3>Data Frame</h3>

* 2-D data is called dataframe

In [2]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

In [3]:
frame = pd.DataFrame(mydataset)

In [30]:
frame # using dataframe function conversion of the dictionary in the form of rows and columns to represent data

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [49]:
frame.loc[1:2] # loc returns row wise value of the specifed label/index or sliced index

    cars  passings
1  Volvo         7
2   Ford         2

In [44]:
frame.loc[0]

cars        BMW
passings      3
Name: 0, dtype: object

In [50]:
frame.loc[[0, 1]]

    cars  passings
0    BMW         3
1  Volvo         7

In [51]:
# same as series we can name our own index

frame_1 = pd.DataFrame(mydataset, index=["OOOO", "OOO", "OO"])

In [52]:
frame_1

       cars  passings
OOOO    BMW         3
OOO   Volvo         7
OO     Ford         2

In [55]:
frame_1.loc["OOOO"]

cars        BMW
passings      3
Name: OOOO, dtype: object

60